lectures/dws-02-notes.tex
% Created 2024-05-15 qua 14:11
% Intended LaTeX compiler: lualatex
\documentclass{scrartcl}
\usepackage[margin=2cm,includefoot,footskip=30pt]{geometry}\usepackage{layout}\usepackage{mathtools}
\usepackage{fvextra}
\usepackage{fancyvrb}
\usepackage{amsmath}
\usepackage[dvipsnames,table]{xcolor}
\usepackage{listings}
\usepackage{fixltx2e}
\usepackage{fontspec}
\defaultfontfeatures{Ligatures=TeX,Scale=MatchLowercase}
\setmainfont[SmallCapsFont={Linux Libertine Capitals}]{Linux Libertine O}
\setsansfont[SmallCapsFont={Linux Biolinum Capitals}]{Linux Biolinum O}
\setmonofont{Source Code Pro}
\DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\small,formatcom={\color[rgb]{0.5,0,0}},breaklines=true}
\input{/home/jefferson/Sync/tex/custom-listings}

\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fvextra}
\fvset{breakbefore=(}
\usepackage{syntax}
\setsansfont{DejaVu Sans}
\setmonofont[Scale=MatchLowercase]{DejaVu Sans Mono}
\author{Prof. Jefferson O. Andrade}
\date{2024-05-15}
\title{Desenvolvimento Web Seguro -- Notas de Aula\\\medskip
\large Semana 02 -- Autenticação e Autorização}
\hypersetup{
 pdfauthor={Prof. Jefferson O. Andrade},
 pdftitle={Desenvolvimento Web Seguro -- Notas de Aula},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.2 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents


\section{Introdução}
\label{sec:orgf5f04a1}

A autenticação e a autorização são componentes críticos na segurança de
aplicações web. Eles garantem que somente usuários legítimos possam acessar o
sistema e que esses usuários só possam realizar ações para as quais estão
autorizados. Aqui estão algumas razões pelas quais a autenticação e a
autorização são essenciais:

\begin{enumerate}
\item \textbf{\textbf{Proteção de Dados Sensíveis:}}
\begin{itemize}
\item A autenticação garante que apenas usuários autorizados possam acessar
informações sensíveis, como dados pessoais, financeiros e comerciais. Sem
autenticação adequada, esses dados podem ser facilmente acessados por
indivíduos não autorizados, levando a vazamentos de informações e
comprometimento de privacidade.
\end{itemize}

\item \textbf{\textbf{Prevenção de Acesso Não Autorizado:}}
\begin{itemize}
\item A autorização assegura que os usuários, mesmo que autenticados, só possam
realizar ações permitidas com base em suas permissões. Isso impede que
usuários com permissões limitadas acessem ou modifiquem recursos críticos
do sistema, como configurações administrativas ou dados de outros usuários.
\end{itemize}

\item \textbf{\textbf{Redução de Riscos de Ataques:}}
\begin{itemize}
\item Implementações fracas de autenticação e autorização são alvos comuns de
ataques cibernéticos, como força bruta, roubo de credenciais e
escalonamento de privilégios. Métodos robustos de autenticação, como a
autenticação multifator (MFA), e modelos de autorização bem definidos, como
RBAC (Role-Based Access Control), ajudam a mitigar esses riscos.
\end{itemize}

\item \textbf{\textbf{Conformidade com Regulamentações:}}
\begin{itemize}
\item Muitas regulamentações de proteção de dados e privacidade, como o GDPR
(Regulamento Geral sobre a Proteção de Dados) e a LGPD (Lei Geral de
Proteção de Dados), exigem que as organizações implementem medidas
adequadas de autenticação e autorização para proteger os dados dos
usuários. A conformidade com essas regulamentações é crucial para evitar
penalidades legais e manter a confiança dos clientes.
\end{itemize}

\item \textbf{\textbf{Manutenção da Integridade do Sistema:}}
\begin{itemize}
\item A autenticação e a autorização protegem a integridade do sistema ao
garantir que apenas usuários legítimos possam realizar ações que afetam o
funcionamento e a segurança da aplicação. Isso inclui prevenir que
atacantes introduzam códigos maliciosos ou façam alterações não autorizadas
no sistema.
\end{itemize}
\end{enumerate}

A autenticação e a autorização são pilares fundamentais na construção de
aplicações web seguras. Elas não apenas protegem os dados e a privacidade dos
usuários, mas também garantem a integridade e a confiabilidade do sistema como
um todo.

\section{Autenticação e Autorização}
\label{sec:org5972197}
\subsection{Definição de Autenticação:}
\label{sec:orgd82fc1a}
Autenticação é o processo de verificar a identidade de um usuário ou sistema. Em
outras palavras, é a etapa onde o sistema confirma que o usuário é quem ele
afirma ser. Isso geralmente é feito por meio de credenciais, como nome de
usuário e senha, mas também pode envolver métodos mais avançados, como biometria
(impressões digitais, reconhecimento facial) ou autenticação multifator (MFA),
que combina vários métodos de verificação.

\subsection{Definição de Autorização:}
\label{sec:org5ca1143}
Autorização é o processo de conceder a um usuário ou sistema permissão para
acessar recursos específicos ou realizar certas ações dentro de um sistema.
Enquanto a autenticação verifica a identidade, a autorização determina o que
essa identidade pode fazer. Por exemplo, após um usuário ser autenticado, o
sistema verifica suas permissões para acessar arquivos, executar comandos ou
modificar dados.

\subsection{Diferenças Entre Autenticação e Autorização:}
\label{sec:orgf54cfc7}

\begin{enumerate}
\item \textbf{\textbf{Propósito:}}
\begin{itemize}
\item \textbf{\textbf{Autenticação:}} Verifica a identidade do usuário. É o processo de garantir que o usuário é quem ele diz ser.
\item \textbf{\textbf{Autorização:}} Controla o acesso aos recursos e ações dentro do sistema. Determina o que o usuário autenticado pode fazer.
\end{itemize}

\item \textbf{\textbf{Etapas do Processo:}}
\begin{itemize}
\item \textbf{\textbf{Autenticação:}} Ocorre primeiro. Sem autenticação, o sistema não pode determinar quais permissões conceder ao usuário.
\item \textbf{\textbf{Autorização:}} Ocorre após a autenticação. Somente usuários autenticados podem ser autorizados a acessar recursos ou executar ações específicas.
\end{itemize}

\item \textbf{\textbf{Métodos Comuns:}}
\begin{itemize}
\item \textbf{\textbf{Autenticação:}} Nome de usuário e senha, tokens, biometria, autenticação multifator (MFA).
\item \textbf{\textbf{Autorização:}} Controle de Acesso Baseado em Funções (RBAC), Controle de Acesso Baseado em Atributos (ABAC), listas de controle de acesso (ACLs).
\end{itemize}

\item \textbf{\textbf{Papel na Segurança:}}
\begin{itemize}
\item \textbf{\textbf{Autenticação:}} Protege o sistema contra acesso não autorizado verificando identidades.
\item \textbf{\textbf{Autorização:}} Protege recursos específicos e funcionalidades do sistema, garantindo que somente usuários autorizados possam acessá-los ou executá-los.
\end{itemize}
\end{enumerate}

\subsection{Exemplo Prático:}
\label{sec:org489bab7}
\begin{itemize}
\item \textbf{\textbf{Autenticação:}} Quando um usuário faz login em um site com seu nome de
usuário e senha, o sistema verifica essas credenciais para confirmar a
identidade do usuário.
\item \textbf{\textbf{Autorização:}} Após o login, o sistema verifica as permissões do usuário.
Por exemplo, um usuário comum pode acessar seu próprio perfil e dados,
enquanto um administrador pode ter acesso a funções adicionais, como
gerenciamento de usuários e configurações do sistema.
\end{itemize}

A autenticação e a autorização são processos distintos, mas complementares, que
juntos garantem que somente usuários legítimos e autorizados possam acessar
recursos e executar ações dentro de um sistema.

\section{Métodos Comuns de Autenticação}
\label{sec:org4f301dd}
\subsection{Nome de Usuário e Senha}
\label{sec:org6b41dcc}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Este é o método mais comum de autenticação, onde os usuários
fornecem um nome de usuário (ou ID) e uma senha para acessar um sistema.
\item \textbf{\textbf{Vantagens:}} Simples e fácil de implementar.
\item \textbf{\textbf{Desvantagens:}} Vulnerável a ataques de força bruta, phishing e
reutilização de senhas. Requer políticas fortes de criação e gerenciamento
de senhas para ser eficaz.
\end{itemize}

\subsection{Tokens de Autenticação}
\label{sec:org1924b6b}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Tokens são gerados pelo servidor e enviados ao cliente após
a autenticação inicial. Os tokens são então usados para autenticar
solicitações subsequentes sem necessidade de enviar novamente o nome de
usuário e senha.
\item \textbf{\textbf{Tipos Comuns:}} JWT (JSON Web Tokens), tokens de sessão.
\item \textbf{\textbf{Vantagens:}} Reduz a exposição das credenciais do usuário e pode ser
usado para autenticação sem estado (stateless authentication).
\item \textbf{\textbf{Desvantagens:}} Necessita de mecanismos seguros para geração,
armazenamento e invalidação de tokens.
\end{itemize}
