lectures/dws-02-notes.tex

\subsection{Biometria}
\label{sec:orgd482624}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Usa características físicas ou comportamentais únicas do
usuário, como impressões digitais, reconhecimento facial ou reconhecimento
de voz, para autenticar a identidade.
\item \textbf{\textbf{Vantagens:}} Difícil de falsificar, elimina a necessidade de memorizar
senhas.
\item \textbf{\textbf{Desvantagens:}} Pode ser invasivo em termos de privacidade, requer
hardware especializado, e pode ser vulnerável a ataques sofisticados.
\end{itemize}

\subsection{Autenticação Multifator (MFA)}
\label{sec:orgba188b1}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Combina dois ou mais métodos de autenticação, como algo que
o usuário conhece (senha), algo que o usuário possui (token), e algo que o
usuário é (biometria).
\item \textbf{\textbf{Vantagens:}} Significativamente mais seguro que métodos de autenticação
únicos, pois um invasor teria que comprometer múltiplos fatores para obter
acesso.
\item \textbf{\textbf{Desvantagens:}} Pode ser mais complexo e caro de implementar, pode causar
inconveniência ao usuário.
\end{itemize}

\subsection{Autenticação Baseada em Certificados}
\label{sec:orged876ac}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Usa certificados digitais para autenticar a identidade do
usuário ou dispositivo. Os certificados são emitidos por uma Autoridade
Certificadora (CA) confiável.
\item \textbf{\textbf{Vantagens:}} Alta segurança, pode ser usado para autenticação de
dispositivos além de usuários.
\item \textbf{\textbf{Desvantagens:}} Requer uma infraestrutura de gerenciamento de
certificados (PKI), pode ser complexo de administrar.
\end{itemize}

\subsection{Autenticação OAuth/OpenID Connect}
\label{sec:org25b72c6}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Permite que os usuários autentiquem-se usando contas de
terceiros (como Google, Facebook) sem precisar criar novas credenciais.
\item \textbf{\textbf{Vantagens:}} Conveniente para usuários, reduz a necessidade de gerenciar
múltiplas senhas.
\item \textbf{\textbf{Desvantagens:}} Depende da segurança e disponibilidade do provedor de
identidade terceiro.
\end{itemize}

\section{Mecanismos de Autorização}
\label{sec:org2bcb5e1}
\subsection{Controle de Acesso Baseado em Funções (RBAC)}
\label{sec:org9c02cb5}
\subsubsection{Definição}
\label{sec:orgbbbcade}
O Controle de Acesso Baseado em Funções (Role-Based Access Control - RBAC) é um
modelo de controle de acesso onde as permissões são atribuídas a funções
específicas dentro de uma organização, e os usuários são então atribuídos a
essas funções. Cada função tem um conjunto definido de permissões que determinam
o que os usuários naquela função podem acessar e realizar dentro do sistema.

\subsubsection{Características Principais}
\label{sec:org1bdd82c}
\begin{itemize}
\item \textbf{\textbf{Funções:}} Representam um conjunto de permissões associadas a uma função
específica dentro da organização (por exemplo, administrador, editor,
visualizador).
\item \textbf{\textbf{Permissões:}} São as ações que podem ser realizadas dentro do sistema (por
exemplo, ler, escrever, excluir).
\item \textbf{\textbf{Usuários:}} São atribuídos a uma ou mais funções, herdando as permissões
associadas a essas funções.
\end{itemize}

\subsubsection{Vantagens}
\label{sec:org226f027}
\begin{itemize}
\item \textbf{\textbf{Facilidade de Gerenciamento:}} Simplifica a administração de permissões,
pois as permissões são atribuídas a funções e não diretamente a usuários.
\item \textbf{\textbf{Escalabilidade:}} Facilita a adição de novos usuários e a atribuição de
permissões à medida que a organização cresce.
\item \textbf{\textbf{Segurança:}} Reduz a possibilidade de erro humano na atribuição de
permissões, garantindo que os usuários tenham apenas as permissões necessárias
para suas funções.
\end{itemize}

\subsubsection{Desvantagens}
\label{sec:org81b5147}
\begin{itemize}
\item \textbf{\textbf{Rigidez:}} Pode ser inflexível em cenários onde os requisitos de acesso são
dinâmicos e mudam frequentemente.
\item \textbf{\textbf{Manutenção:}} Requer manutenção constante para garantir que as funções e
suas permissões estejam atualizadas e alinhadas com as necessidades da
organização.
\end{itemize}

\subsection{Controle de Acesso Baseado em Atributos (ABAC)}
\label{sec:orgd5f10a4}
\subsubsection{Definição}
\label{sec:org584c86c}
O Controle de Acesso Baseado em Atributos (Attribute-Based Access Control -
ABAC) é um modelo de controle de acesso onde as permissões são atribuídas com
base em um conjunto de atributos e políticas que determinam as condições sob as
quais o acesso é permitido. Os atributos podem incluir características do
usuário, do recurso ou do ambiente.

\subsubsection{Características Principais}
\label{sec:orge4a425c}
\begin{itemize}
\item \textbf{\textbf{Atributos:}} Podem incluir atributos do usuário (por exemplo, função,
departamento), atributos do recurso (por exemplo, tipo de documento,
classificação), e atributos do ambiente (por exemplo, horário, localização).
\item \textbf{\textbf{Políticas:}} Definem as regras que determinam as condições sob as quais o
acesso é permitido ou negado. As políticas são escritas em termos de atributos
e suas combinações.
\item \textbf{\textbf{Decisões de Acesso:}} São feitas em tempo real com base na avaliação dos
atributos e nas políticas definidas.
\end{itemize}

\subsubsection{Vantagens}
\label{sec:orgcb5c282}
\begin{itemize}
\item \textbf{\textbf{Flexibilidade:}} Oferece um controle de acesso mais granular e dinâmico,
adaptando-se facilmente a mudanças nos requisitos de acesso.
\item \textbf{\textbf{Segurança:}} Permite a implementação de políticas de segurança complexas que
consideram múltiplos fatores, melhorando a precisão das decisões de acesso.
\item \textbf{\textbf{Personalização:}} Permite personalizar o acesso com base em uma ampla
variedade de atributos, proporcionando um controle mais detalhado.
\end{itemize}

\subsubsection{Desvantagens}
\label{sec:org9e6accd}
\begin{itemize}
\item \textbf{\textbf{Complexidade:}} Pode ser mais complexo de implementar e gerenciar devido à
necessidade de definir e manter políticas e atributos.
\item \textbf{\textbf{Desempenho:}} A avaliação em tempo real de atributos e políticas pode
impactar o desempenho, especialmente em sistemas com grande volume de acessos.
\end{itemize}

\section{Estudos de Caso}
\label{sec:orga681c29}

\subsection{Caso Target (2013)}
\label{sec:org05937ab}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Em 2013, a Target sofreu uma das maiores violações de dados da
história, resultando no comprometimento de informações de cartão de crédito e
débito de aproximadamente 40 milhões de clientes.
\item \textbf{\textbf{Problema:}} Os atacantes exploraram credenciais de um fornecedor de HVAC
(aquecimento, ventilação e ar condicionado) para acessar a rede da Target. Uma
vez dentro, eles conseguiram se mover lateralmente pela rede devido a falhas
de autorização inadequadas.
\item \textbf{\textbf{Consequências:}} Perda financeira significativa, dano à reputação e custos
legais elevados.
\item \textbf{\textbf{Lições Aprendidas:}} Implementação de autenticação multifator (MFA) e
segmentação de rede para limitar o acesso a partes críticas do sistema.
\end{itemize}

\subsection{Caso Uber (2016)}
\label{sec:org833ffe5}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Em 2016, a Uber sofreu uma violação de dados que expôs
informações pessoais de 57 milhões de motoristas e passageiros.
\item \textbf{\textbf{Problema:}} Os atacantes conseguiram acessar uma base de dados armazenada na
AWS usando credenciais de acesso que foram acidentalmente expostas em um
repositório de código no GitHub.
\item \textbf{\textbf{Consequências:}} Pagamento de US\$ 148 milhões em um acordo judicial, além de
danos à reputação.
\item \textbf{\textbf{Lições Aprendidas:}} Uso de práticas seguras de gerenciamento de credenciais
e autenticação multifator para acessar recursos sensíveis.
\end{itemize}
