lectures/dws-02-notes.tex

\subsection{Caso Equifax (2017)}
\label{sec:org2b61d3d}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Em 2017, a Equifax sofreu uma violação massiva de dados que
expôs informações pessoais de 147 milhões de pessoas.
\item \textbf{\textbf{Problema:}} A vulnerabilidade inicial foi uma falha de autorização em um
portal web da Equifax. A falta de segmentação adequada e de controles de
autorização permitiu que os atacantes acessassem grandes volumes de dados.
\item \textbf{\textbf{Consequências:}} Multas significativas, perda de confiança do consumidor e
altos custos de mitigação e reparação.
\item \textbf{\textbf{Lições Aprendidas:}} Implementação de controles de autorização robustos e
segmentação de rede para limitar o acesso a dados sensíveis.
\end{itemize}

\subsection{Caso Facebook (2018)}
\label{sec:orga571a87}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Em 2018, o Facebook revelou uma violação que afetou cerca de 50
milhões de contas de usuários.
\item \textbf{\textbf{Problema:}} Uma falha no sistema de autenticação permitiu que atacantes
roubassem tokens de acesso, que poderiam ser usados para assumir o controle
das contas dos usuários.
\item \textbf{\textbf{Consequências:}} Exposição de informações pessoais, investigações
regulatórias e danos à reputação.
\item \textbf{\textbf{Lições Aprendidas:}} Revisão e fortalecimento dos mecanismos de autenticação
e implementação de monitoramento contínuo para detectar atividades suspeitas.
\end{itemize}

\subsection{Caso Twitter (2020)}
\label{sec:orgf01d17e}
\begin{itemize}
\item \textbf{\textbf{Descrição:}} Em 2020, várias contas de alto perfil no Twitter foram
comprometidas em um ataque de engenharia social.
\item \textbf{\textbf{Problema:}} Os atacantes enganaram os funcionários do Twitter para que
revelassem suas credenciais, permitindo acesso às ferramentas internas de
administração.
\item \textbf{\textbf{Consequências:}} Controle temporário de contas de alto perfil, divulgação de
mensagens fraudulentas e investigação por agências governamentais.
\item \textbf{\textbf{Lições Aprendidas:}} Educação contínua dos funcionários sobre engenharia
social e implementação de autenticação multifator para acessos
administrativos.
\end{itemize}
\end{document}
